# Core Tools
brew "git"
brew "gh"
brew "jq"
brew "wget"

# Cloud & Infrastructure
brew "awscli"
brew "azure-cli"
brew "azurite"

# AI
brew "gemini-cli"

# Runtimes
brew "mise"

# Apps
cask "visual-studio-code"
cask "wezterm"

# Shell prompt
brew "starship"

# Tools
brew "bat"
brew "eza"
cask "font-geist-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "ngrok"
