# Core Tools
brew "git"
brew "gh"
brew "jq"
brew "wget"

# Cloud & Infrastructure
brew "awscli"

# Runtimes
brew "mise"
brew "uv"

# Apps
cask "visual-studio-code"
cask "wezterm"
cask "docker-desktop"
cask "tableplus"
cask "obsidian"

# Document Processing
brew "pandoc"
cask "basictex"

# AI
brew "skills"
brew "googleworkspace-cli"
cask "claude-code"

# Agent Orchestration
brew "gastown"
brew "go"
brew "dolt"
brew "beads"
brew "tmux"

# Tools
brew "gitleaks"
brew "bat"
brew "eza"
cask "font-geist-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "ngrok"
