# Core Tools
brew "git"
brew "gh"
brew "jq"
brew "wget"

# Cloud & Infrastructure
brew "awscli"

# Runtimes
brew "mise"
brew "uv"

# Apps
cask "visual-studio-code"
cask "wezterm"

# Document Processing
brew "pandoc"
cask "basictex"

# AI
brew "skills"

# Tools
brew "bat"
brew "eza"
cask "font-geist-mono-nerd-font"
cask "font-departure-mono-nerd-font"
cask "ngrok"
